podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/WDOG_MKE15Z7.svd.xml
<!--
Devices using this peripheral: 
      MKE15Z7
-->
      <peripheral>
         <?sourceFile "WDOG_MKE15Z7" ?>
         <name>WDOG</name>
         <description>Watchdog timer</description>
         <groupName>WDOG</groupName>
         <prependToName>WDOG</prependToName>
         <headerStructName>WDOG</headerStructName>
         <baseAddress>0x40052000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CS</name>
               <description>Watchdog Control and Status Register</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x2980</resetValue>
               <fields>
                  <field>
                     <name>STOP</name>
                     <description>Stop Enable: This write-once bit enables the watchdog to operate when the chip is in stop mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled in chip stop mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled in chip stop mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAIT</name>
                     <description>Wait Enable: This write-once bit enables the watchdog to operate when the chip is in wait mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled in chip wait mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled in chip wait mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBG</name>
                     <description>Debug Enable: This write-once bit enables the watchdog to operate when the chip is in debug mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled in chip debug mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled in chip debug mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TST</name>
                     <description>Test: Enables the fast test mode. The test mode allows software to exercise all bits of the counter to demonstrate that the watchdog is functioning properly. This write-once field is cleared (0:0) on POR only. Any other reset does not affect the value of this field</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Test mode disabled</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>User mode enabled. (Watchdog test mode disabled.) After testing the watchdog, software should use this setting to indicate that the watchdog is functioning normally in user mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Test mode enabled, only the low byte is used. CNTL is compared with TOVALL</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Test mode enabled, only the high byte is used. CNTH is compared with TOVALH</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPDATE</name>
                     <description>Allow updates: This write-once bit allows software to reconfigure the watchdog without a reset</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Updates not allowed. After the initial configuration, the watchdog cannot be later modified without forcing a reset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Updates allowed. Software can modify the watchdog configuration registers within 128 bus clocks after performing the unlock write sequence</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INT</name>
                     <description>Interrupt: This write-once bit configures the watchdog to generate an interrupt request upon a reset-triggering event (timeout or illegal write to the watchdog), prior to forcing a reset. After the interrupt vector fetch, the reset occurs after a delay of 128 bus clocks</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupts are disabled. Watchdog resets are not delayed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupts are enabled. Watchdog resets are delayed by 128 bus clocks</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Enable: This write-once bit enables the watchdog counter to start counting</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>Clock: \n
This write-once field indicates the clock source that feeds the watchdog counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Bus clock</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>1 kHz internal low-power oscillator (LPOCLK)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>32 kHz internal oscillator (ICSIRCLK)</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>External clock source</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCS</name>
                     <description>Reconfiguration Success</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reconfiguring WDOG</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reconfiguration is successful</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ULK</name>
                     <description>Unlock status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>WDOG is locked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>WDOG is unlocked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRES</name>
                     <description>Prescalar: This write-once bit enables a fixed 256 pre-scaling of watchdog counter reference clock. (The block diagram shows this clock divider option.)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>256 prescalar disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>256 prescalar enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EN" > <name>CMD32EN</name> <description>Enables or disables WDOG support for 32-bit (otherwise 16-bit or 8-bit) refresh/unlock command write words</description> <bitOffset>13</bitOffset> </field>
                  <field>
                     <name>FLG</name>
                     <description>Interrupt Flag: This bit is an interrupt indicator when INT is set in control and status register 1. Write 1 to clear it</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No interrupt occurred</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>An interrupt occurred</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WIN</name>
                     <description>Window: This write-once bit enables window mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Window mode disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Window mode enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNT</name>
               <description>Counter Register: \n
The watchdog counter registers CNT provide access to the value of the free-running watchdog counter. Software can read the counter registers at any time.\n
Software cannot write directly to the watchdog counter; however, two write sequences to these registers have special functions:\n
1. The refresh sequence resets the watchdog counter to 0x0000.\n
2. The unlock sequence allows the watchdog to be reconfigured without forcing a reset (when CS1[UPDATE] = 1).\n
NOTE: All other writes to these registers are illegal and force a reset</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>CNTLOW</name>
                     <description>Low byte of the Watchdog Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>CNTHIGH</name>
                     <description>High byte of the Watchdog Counter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNTLOW</name>
               <description>Counter Register: Low (see CNT for description)</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
            </register>
            <register>
               <name>CNTHIGH</name>
               <description>Counter Register: High (see CNT for description)</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
            </register>
            <register>
               <name>TOVAL</name>
               <description>Timeout Value Register: \n
The watchdog timeout value registers TOVAL contains the 16-bit value used to set the timeout period of the watchdog. \n
The watchdog counter CNT is continuously compared with the timeout value TOVAL. If the counter reaches the timeout value, the watchdog forces a reset.\n
NOTE: Writing 0 to the Watchdog Timeout Value Register generates an immediate reset</description>
               <addressOffset>0x8</addressOffset>
               <resetValue>0x400</resetValue>
               <fields>
                  <field>
                     <name>TOVALLOW</name>
                     <description>Low byte of the timeout value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TOVALHIGH</name>
                     <description>High byte of the timeout value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOVALLOW</name>
               <description>Timeout Value Register: Low (see TOVAL for description)</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <access>read-write</access>
               <resetMask>0xFF</resetMask>
            </register>
            <register>
               <name>TOVALHIGH</name>
               <description>Timeout Value Register: High (see TOVAL for description)</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <access>read-write</access>
               <resetMask>0xFF</resetMask>
            </register>
            <register>
               <name>WIN</name>
               <description>Window Register:\n
When window mode is enabled WIN determine the earliest time that a refresh sequence is considered valid.\n
WIN must be less than TOVAL</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>WINLOW</name>
                     <description>Low byte of Watchdog Window</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>WINHIGH</name>
                     <description>High byte of Watchdog Window</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINLOW</name>
               <description>Window Register: Low (see WIN for description)</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <access>read-write</access>
               <resetMask>0xFF</resetMask>
            </register>
            <register>
               <name>WINHIGH</name>
               <description>Window Register: High (see WIN for description)</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <access>read-write</access>
               <resetMask>0xFF</resetMask>
            </register>
         </registers>
      </peripheral>
